# Задача 2: Найдите сумму цифр трехзначного числа.
a = int(input())
b = a // 100
c = (a // 10) % 10
d = a % 10
print(b + c + d)